const duas = [

{
text: `أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ، اللهم إني أسألك خير هذه الليلة فتحها ونصرها ونورها وبركتها وهدها، وأعوذ بك من شر ما فيها وشر ما بعدها.`,
benefit: "🤍 دعاء دخول المساء"
},

{
text: `اللهم بك أمسينا وبك أصبحنا وبك نحيا وبك نموت وإليك المصير.`,
benefit: "🌿 التوكل على الله"
},

{
text: `اللهم إني أمسيت أشهدك وأشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله لا إله إلا أنت وحدك لا شريك لك وأن محمدًا عبدك ورسولك.`,
benefit: "✨ فضل: شهادة التوحيد"
},

{
text: `رَضِيتُ بِاللَّهِ رَبًّا وَبِالإِسْلَامِ دِينًا وَبِمُحَمَّدٍ ﷺ نَبِيًّا.`,
benefit: "🕊️ سبب للرضا والثبات"
},

{
text: `أعوذ بكلمات الله التامات من شر ما خلق.`,
benefit: "🛡️ حصن من كل شر"
},

{
text: `بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ.`,
benefit: "🤍 حماية من الأذى"
},

{
text: `حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ.`,
benefit: "🌿 كفاية وتوكل"
},

{
text: `اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ.`,
benefit: "✨ طلب العافية"
},

{
text: `اللهم ما أمسى بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك فلك الحمد ولك الشكر.`,
benefit: "🤍 شكر النعم"
},

{
text: `أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ وَشَرِّ عِبَادِهِ وَمِنْ هَمَزَاتِ الشَّيَاطِينِ.`,
benefit: "🛡️ حماية قوية"
},

{
text: `سورة الإخلاص: قُلْ هُوَ اللَّهُ أَحَدٌ ۝ اللَّهُ الصَّمَدُ ۝ لَمْ يَلِدْ وَلَمْ يُولَدْ ۝ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ`,
benefit: "☁️ تعدل ثلث القرآن"
},

{
text: `سورة الفلق: قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ۝ مِن شَرِّ مَا خَلَقَ ۝ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝ وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ۝ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ`,
benefit: "🛡️ حماية من الحسد"
},

{
text: `سورة الناس: قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝ إِلَٰهِ النَّاسِ ۝ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ۝ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۝ مِنَ الْجِنَّةِ وَالنَّاسِ`,
benefit: "🕊️ من الوسواس"
},

{
text: `آية الكرسي: اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۚ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ`,
benefit: "🛡️ حفظ من الله حتى يصبح"
}

];

let current = 0;

const text = document.getElementById("duaText");
const benefit = document.getElementById("duaBenefit");
const counter = document.getElementById("duaCounter");

function show() {
text.innerText = duas[current].text;
benefit.innerText = duas[current].benefit;
counter.innerText = `${current + 1} من ${duas.length}`;
}

function nextDua() {
current++;
if(current >= duas.length) current = 0;
show();
}

function prevDua() {
current--;
if(current < 0) current = duas.length - 1;
show();
}

show();
