const duas = [

{
text: `<span class="quran-text">
اللّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
</span>`,
benefit: "🤍 آية الكرسي: حفظ من الله حتى يمسي."
},

{
text: `<span class="quran-text">
قُلْ هُوَ اللَّهُ أَحَدٌ ۝ اللَّهُ الصَّمَدُ ۝ لَمْ يَلِدْ وَلَمْ يُولَدْ ۝ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ
</span>`,
benefit: "☁️ الإخلاص: تعدل ثلث القرآن."
},

{
text: `<span class="quran-text">
قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ۝ مِن شَرِّ مَا خَلَقَ ۝ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝ وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ۝ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ
</span>`,
benefit: "🌿 الفلق: حماية من الحسد والشر."
},

{
text: `<span class="quran-text">
قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝ إِلَٰهِ النَّاسِ ۝ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ۝ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۝ مِنَ الْجِنَّةِ وَالنَّاسِ
</span>`,
benefit: "🕊️ الناس: حماية من الوسواس."
},

{
text: "أصبحنا وأصبح الملك لله، والحمد لله لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير.",
benefit: "🤍 ذكر التوحيد في بداية اليوم."
},

{
text: "اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت وإليك النشور.",
benefit: "🌿 التوكل على الله."
},

{
text: "اللهم إني أسألك خير هذا اليوم فتحه ونصره ونوره وبركته.",
benefit: "✨ طلب الخير في اليوم."
},

{
text: "رضيت بالله ربًا وبالإسلام دينًا وبمحمد ﷺ نبيًا.",
benefit: "🕊️ سبب للثبات والرضا."
},

{
text: "أعوذ بكلمات الله التامات من شر ما خلق.",
benefit: "☁️ حصن من الشرور."
},

{
text: "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم.",
benefit: "🤍 حصن يومي."
},

{
text: "حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم.",
benefit: "🌿 كفاية وتوكل."
},

{
text: "اللهم إني أسألك العافية في الدنيا والآخرة.",
benefit: "✨ أعظم دعاء للعافية."
},

{
text: "اللهم ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك فلك الحمد ولك الشكر.",
benefit: "🤍 شكر لله على النعم."
},

{
text: "أستغفر الله العظيم وأتوب إليه.",
benefit: "🌿 استغفار وراحة للقلب."
}

];

let currentDua = 0;

const duaText = document.getElementById("duaText");
const duaBenefit = document.getElementById("duaBenefit");
const duaCounter = document.getElementById("duaCounter");

function showDua() {

duaText.innerHTML = duas[currentDua].text;
duaBenefit.innerText = duas[currentDua].benefit;
duaCounter.innerText = `${currentDua + 1} من ${duas.length}`;

}

function nextDua() {

currentDua++;
if(currentDua >= duas.length){
currentDua = 0;
}
showDua();

}

function prevDua() {

currentDua--;
if(currentDua < 0){
currentDua = duas.length - 1;
}
showDua();

}

showDua();
