const duas = [

{
text: "بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى رَبِّنَا تَوَكَّلْنَا.",
benefit: "🏠 دعاء دخول المنزل وحفظه من الشيطان"
},

{
text: "بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ.",
benefit: "🚪 دعاء الخروج من المنزل وحفظ وتوفيق"
},

{
text: "اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ خَيْرَهُ وَخَيْرَ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ.",
benefit: "✨ دعاء لبس الثوب الجديد"
},

{
text: "بِسْمِ اللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ.",
benefit: "🧥 دعاء عند خلع اللباس"
},

{
text: "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا هُوَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا هُوَ لَهُ.",
benefit: "👕 دعاء عند لبس أي لباس"
},

{
text: "السواك عند كل صلاة.",
benefit: "🪥 سنة عظيمة لتطهير الفم"
},

{
text: "إفشاء السلام بين الناس.",
benefit: "🤝 سبب للمحبة ودخول الجنة"
},

{
text: "صلاة الضحى.",
benefit: "🌿 صدقة عن كل مفصل في الجسد"
},



{
text: "النوم على وضوء.",
benefit: "🛡️ حماية حتى الصباح"
},

{
text: "قراءة آية الكرسي قبل النوم.",
benefit: "🌙 حفظ من الشيطان"
},

{
text: "البدء باليمين في اللبس والطهارة.",
benefit: "✨ من هدي النبي ﷺ"
},

{
text: "الأكل باليمين والتسمية قبل الأكل.",
benefit: "🍽️ بركة في الطعام"
},

{
text: "الحمد بعد الأكل.",
benefit: "🤍 شكر لله على النعمة"
},

{
text: "دعاء الخروج من المنزل: بسم الله توكلت على الله ولا حول ولا قوة إلا بالله.",
benefit: "🛡️ حفظ وتوفيق من الله"
},

{
text: "ذكر الله بعد الفجر حتى الشروق.",
benefit: "☀️ أجر حجة وعمرة"
},

{
text: "التبسم في وجه الناس.",
benefit: "😊 صدقة"
},

{
text: "إماطة الأذى عن الطريق.",
benefit: "🛤️ صدقة"
},

{
text: "كثرة الاستغفار.",
benefit: "🌿 تفريج الهموم"
},

{
text: "قيام الليل ولو ركعتين.",
benefit: "🌙 قربة عظيمة إلى الله"
},

{
text: "صلة الرحم.",
benefit: "❤️ بركة في العمر والرزق"
},

{
text: "الدعاء بين الأذان والإقامة.",
benefit: "✨ دعاء لا يُرد"
}

];

let current = 0;

const text = document.getElementById("duaText");
const benefit = document.getElementById("duaBenefit");
const counter = document.getElementById("duaCounter");

function show() {
text.innerText = duas[current].text;
benefit.innerText = duas[current].benefit;
counter.innerText = `${current + 1} من ${duas.length}`;
}

function nextDua() {
current++;
if (current >= duas.length) current = 0;
show();
}

function prevDua() {
current--;
if (current < 0) current = duas.length - 1;
show();
}

show();
